000100191108     A          R SHIFTWEEK                 PFILE(SENECAPAY/SHIFTWEEK)
000101191108     A          K EMPNUM
000102191108
000109191108
