000100191101     A          R RECORD1
000101191101     A                                  2  4USER
000102191101     A                                  2 28'Payroll Program Completed'
000103191101     A                                  2 66DATE EDTCDE(Y)
000104191101     A                                  3  4'DAVID ZAK'
000105191101     A                                  5 10'Rates:'
000106191101     A                                  7 19'Day Rate:'
000107191101     A            DAYRATE        5  2   7 37EDTCDE(1)
000108191101     A                                  8 19'Afternoon Rate:'
000109191101     A            AFTNRATE       5  2   8 37EDTCDE(1)
000110191101     A                                  9 19'Night Rate:'
000111191101     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000112191101     A                                 11 11'Totals:'
000113191101     A                                 13 19'Regular Pay:'
000114191101     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000115191101     A                                 14 19'Overtime Pay:'
000116191101     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000117191101     A                                 15 19'Company Payout:'
000118191101     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000119191122     A            SHIFTTYPE     30   O 10 20
000120191101
000121191101
