000100191108     A          R SHIFTWEEK                 PFILE(SENECAPAY/SHIFTWEEK)
000101191108     A          K EMPNUM
000102191108     A          S WORKSHIFT                 COMP(EQ '1')
000103191108
