000100191101     A          R TITLE
000101191101
000102191101     A                                  1 45'Weekly Payroll Report'
000103191101
000104191101     A                                  1 89'Page:'
000105191101
000106191101     A                                  1 94PAGNBR
000107191101
000108191101     A                                  1  3DATE(*YY)
000109191101
000110191101     A                                      EDTCDE(Y)
000111191101
000112191101     A                                  1 15TIME
000113191101
000114191101     A                                  2  3'DAVID ZAK'
000115191101
000116191101     A                                  3  3 ' '
000117191108     A            SHIFTTYPE     30      2 40
000118191101
000119191101     A          R COLHDG                    SPACEB(1)
000120191101
000121191101     A                                      SPACEA(1)
000122191101
000123191101     A                                     6'Employee'
000124191101
000125191101     A                                    19'Work'
000126191101
000127191101     A                                    29'Pay'
000128191101
000129191101     A                                    37'Hourly'
000130191101
000131191101     A                                    47'Hours'
000132191101
000133191101     A                                    56'Regular'
000134191101
000135191101     A                                    71'Overtime'
000136191101
000137191101     A                                    89'Total'
000138191101
000139191101     A                                     6'Number'
000140191101
000141191101     A                                      SPACEB(1)
000142191101
000143191101     A                                    19'Shift'
000144191101
000145191101     A                                    29'Grade'
000146191101
000147191101     A                                    37'Rate'
000148191101
000149191101     A                                    47'Worked'
000150191101
000151191101     A                                    56'Pay'
000152191101
000153191101     A                                    73'Pay'
000154191101
000155191101     A                                    90'Pay'
000156191101
000157191101     A          R EMPDETAIL                 SPACEB(1)
000158191101
000159191101     A            EMPNUM    R    9S 0      5REFFLD(SHIFTWEEK/EMPNUM +
000160191101
000161191101     A                                      SENECAPAY/SHIFTWEEK)
000162191101
000163191101     A                                      EDTWRD('0   -   -   -')
000164191101
000165191101     A            WORKSHIFT R    1A       20REFFLD(SHIFTWEEK/WORKSHIFT +
000166191101
000167191101     A                                      SENECAPAY/SHIFTWEEK)
000168191101
000169191101     A            PAYGRADE  R             30REFFLD(SHIFTWEEK/PAYGRADE +
000170191101
000171191101     A                                      SENECAPAY/SHIFTWEEK)
000172191101
000173191101     A            HOURLYRATE     5  2     37EDTCDE(1)
000174191101
000175191101     A            HRSWORKED R             48REFFLD(SHIFTWEEK/HRSWORKED +
000176191101
000177191101     A                                      SENECAPAY/SHIFTWEEK)
000178191101
000179191101     A                                      EDTCDE(1)
000180191101
000181191101     A            REGULARPAY     7  2     55EDTCDE(1)
000182191101
000183191101     A            OVERPAY        7  2     70EDTCDE(2)
000184191101
000185191101     A            WEEKLYPAY      7  2     86EDTCDE(1)
000186191101
000187191101     A          R TOTALS                    SPACEB(2)
000188191101
000189191101     A                                    41'Totals:'
000190191101
000191191101     A            TOTREGPAY      9  2     51
000192191101
000193191101     A                                      EDTCDE(1 $)
000194191101
000195191101     A            TOTOVTPAY      9  2     66EDTCDE(1 $)
000196191101
000197191101     A            TOTWKPAY       9  2     82EDTCDE(1 $)
